---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData.GetPipeFittingAndAccessoryData
source: html/46547a49-5faa-8311-2ff5-706cfdac3ac5.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData.GetPipeFittingAndAccessoryData Method

Returns the fitting and accessory information

## Syntax (C#)
```csharp
public PipeFittingAndAccessoryData GetPipeFittingAndAccessoryData()
```